АлогистикТест2/src/DataProcessors/ГрафическоеОтображениеСушКомплекса/ГрафическоеОтображениеСушКомплекса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрафическоеОтображениеСушКомплекса</name>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_СостояниеСушильныхКамер/алк_СостояниеСушильныхКамер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_СостояниеСушильныхКамер</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Неисправна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/DataProcessors/ГрафическоеОтображениеСушКомплекса/Forms/ФормаИсторииНеисправностей/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	Элементы.История.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	РедактироватьНаКлиенте();	
КонецПроцедуры  

&НаКлиенте
Процедура ИсторияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	РедактироватьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьНаКлиенте()
	ТекДанные = Элементы.История.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда 
		Сообщить("Ошибка! Не выделена строка для редактирования.");  
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Период",ТекДанные.Период);
	ПараметрыФормы.Вставить("Склад",ТекДанные.Склад);
	ПараметрыФормы.Вставить("Камера",ТекДанные.СушильнаяКамера);
	ПараметрыФормы.Вставить("Неисправна",ТекДанные.Неисправна); 
		
	ОткрытьФорму("Обработка.ГрафическоеОтображениеСушКомплекса.Форма.ФормаРедактированияСостоянияКамеры",ПараметрыФормы, ЭтаФорма,,,,Новый ОписаниеОповещения("ПриЗакрытииФормыРедактиррованияОбновитьИсториюСостояний",ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекДанные = Элементы.История.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда 
		Сообщить("Ошибка! Не выделена строка для удаления.");  
		Возврат;
	КонецЕсли; 
	
	Если НЕ РазрешитьУдалитьЗаписьОСостоянииКамеры(ТекДанные.Период,ТекДанные.СушильнаяКамера) Тогда 
		Сообщить("Запись не может быть удалена! Удалить можно только последнюю запись по камере!"); 
		Возврат;
    КонецЕсли;

	ВопросПриИзмененииСостоянияКамеры("Выделенная строка будет удалена. Продолжить?",ТекДанные);  
	
КонецПроцедуры 

&НаКлиенте
Процедура ВопросПриИзмененииСостоянияКамеры(Вопрос,Строка)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПоИзменениюСостоянияКамеры",
	ЭтотОбъект,Новый Структура("Строка",Строка));	
	
	ПоказатьВопрос(Оповещение,
	Вопрос,
	РежимДиалогаВопрос.ДаНет,
	0, 
	КодВозвратаДиалога.Да, 
	"Внимание!" 
	);    
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПоИзменениюСостоянияКамеры(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		УдалитьСтроку(Параметры.Строка);
	КонецЕсли;
	
	Элементы.История.Обновить();
	
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура УдалитьСтроку(СтрокаНаУдаление)   
	Запись = РегистрыСведений.алк_СостояниеСушильныхКамер.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись,СтрокаНаУдаление);
	Запись.Удалить();	
КонецПроцедуры

//проверка действительно ли запись о состоянии камеры можно удалить
Функция РазрешитьУдалитьЗаписьОСостоянииКамеры(Период,СушильнаяКамера)   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_СостояниеСушильныхКамер.Неисправна
	               |ИЗ
	               |	РегистрСведений.алк_СостояниеСушильныхКамер КАК алк_СостояниеСушильныхКамер
	               |ГДЕ
	               |	алк_СостояниеСушильныхКамер.Период > &Период
	               |	И алк_СостояниеСушильныхКамер.СушильнаяКамера = &СушильнаяКамера";  
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("СушильнаяКамера",СушильнаяКамера); 
	РезЗапроса = Запрос.Выполнить();
	Если РезЗапроса.Пустой() Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыРедактиррованияОбновитьИсториюСостояний(Результат, Параметры) Экспорт 
	Элементы.История.Обновить();
КонецПроцедуры
